#include <iostream>
#include <cmath>
using namespace std;
//Руда Єлизавета ФІТ 1-4 В12

int main()
{
    setlocale(0, ".1251");

    int cas;
    cout << "Введіть номер задачі 1, 2 або 3 ";
    cin >> cas;
    int N, answ;//для 1 задачі
    int a, b, k; //2
    int n = 1, divider = 0, z = 0; //2
    double k1;//3
    int i = 0;//3


    switch (cas)
    {
    case (1):
        cout << " Ви обрали задачу 2." << endl << "Знайти кількість пар сусідніх чисел аі, які є парними. " << endl;
        cout << " Введіть натуральне число: ";
        cin >> N;
        while (N < 1) //Перевіряємо поки не буде введене число від 1
        {
            cout << "Ви ввели недопустиме значення. Введіть число від 1 включно " << endl;
            cin >> N;
        }
        cout.precision(1);//Прибираємо всі знаки після коми, якщо користувач ввів не ціле число
   
        if (N % 2 == 0)//Число парне?
        {
            answ = (N / 2) - 1;
        }
        else//Ні
        {
            answ = (N - 1) / 2;
        }
        cout << "К-ть пар сусідніх чисел, які є парними = " << answ << endl;
        break;


    case (2):
        cout << " Ви обрали задачу 2." << endl << "Знайти всі цілі числа з проміжку [a;b], у яких кількість дільників дорівнює k." << endl;
       
        cout << "Введіть значення прміжку цілих чисел a = ";
        cin >> a;
        cout << "Введіть значення прміжку цілих чисел b = ";
        cin >> b;
        cout << "Чому дорівнює кількість дільників? ";
        cin >> k;
       
        cout << "Усі цілі числа у яких к-ть дільників = " << k << ":" << endl;

        for (int count1 = a; count1 <= b; ++count1)
        {
            //Рахуємо скільки перше число в проміжку від а до b має дільників
            for (int count = 0; count <= abs(a); ++count) //Беремо модуль числа, бо ціле числе може бути від'ємним і рахунок не працюватиме
            {
                if ((a % n) == 0)
                {
                    ++divider;
                    ++n;
                }
                else
                {
                    ++n;
                }
            }

            //Якщо к-ть дільників в числі = к, то додаємо 1 до к-ті чисел задовольняючих умову
            if (k == divider)
            {
                cout << a << "  ";
                ++z;
                divider = 0; //повертає лічильник на 0 для перевірки наступного числа
                n = 1; //повертає 
            }
            else
            {
                divider = 0;
                n = 1;
            }
            ++a;
        }
        // cout << divider;
        cout << endl << "Всього таких чисел - " << z;
        break;

    case (3):
        cout << " Ви обрали задачу 3." << endl;
        cout << "Дано гирі вагою в 0.1кг, 0.2кг, 0.3 кг, 0.5кг, 1кг, 1.2кг, 1.4кг, 1.5кг, 2кг і 3кг" << endl;
        //Тобто мінімальна вага яку може надати користувач = 0.1кг
        //А максимальона = сумі усіх гирь =12.2кг
        cout << "Введіть вагу в кілограмах від 0.1кг до 12.2кг. ";
        cin >> k1;
        while (k1 < 0.1 || k1 > 12.2)
        {
            cout << "Ви ввели недопустиме значення. Введіть від 0.1 до 12.2. ";
            cin >> k1;
        }
        //мінімальна кількість гирь 
        while (k1 >= 3)
        {   k1 = k1 - 3;
            ++i;  }
        while (k1 >= 2)
        {   k1 = k1 - 2;
            ++i;  }
        while (k1 >= 1.5)
        {   k1 = k1 - 1.5;
            ++i;  }
        while (k1 >= 1.4)
        {   k1 = k1 - 1.4;
            ++i;  }
        while (k1 >= 1.2)
        {   k1 = k1 - 1.2;
            ++i;  }
        while (k1 >= 1)
        {   k1 = k1 - 1;
            ++i;  }
        while (k1 >= 0.5)
        {   k1 = k1 - 0.5;
            ++i;  }
        while (k1 >= 0.3)
        {   k1 = k1 - 0.3;
            ++i;  }
        while (k1 >= 0.2)
        {   k1 = k1 - 0.2;
            ++i;  }
        while (k1 >= 0.1)
        {   k1 = k1 - 0.1;
            ++i;  }

        cout << "Таку вагу можна скласти " << i << " гирями.";
        break;
    }
}


