#include <iostream>
#include <cmath>
using namespace std;
//Руда Єлизавета ФІТ 1-4 В12

int main()
{
    setlocale(0, ".1251");
      cout << " Ви обрали задачу 2." << endl <<"Знайти всі цілі числа з проміжку [a;b], у яких кількість дільників дорівнює k." << endl;
    int a, b, k;
      cout << "Введіть значення прміжку цілих чисел a = ";
      cin >> a;
      cout << "Введіть значення прміжку цілих чисел b = ";
      cin >> b;
      cout << "Чому дорівнює кількість дільників? ";
      cin >> k;
    int n = 1, divider = 0, z = 0;

    cout << "Усі цілі числа у яких к-ть дільників = " << k << ":" <<  endl;

      for (int count1 = a; count1 <= b; ++count1) 
      {
        //Рахуємо скільки перше число в проміжку від а до b має дільників
        for (int count = 0; count <= abs(a-1); ++count) //Беремо модуль числа, бо ціле числе може бути від'ємним і рахунок не працюватиме
        {
            if ((a % n) == 0)
            {
                ++divider;
                ++n;
            }
            else
            {
                ++n;
            }
        }
       
        //Якщо к-ть дільників в числі = к, то додаємо 1 до к-ті чисел задовольняючих умову
        if (k == divider)
        {
           cout << a <<"  ";
            ++z;
            divider = 0; //повертає лічильник на 0 для перевірки наступного числа
            n = 1; //повертає 
        }
        else
        {
            divider = 0; 
            n = 1;
        }
        ++a;
      }
       // cout << divider;
        cout << endl << "Всього таких чисел - " <<  z;
       
}
#include <iostream>
#include <cmath>
#include <limits>
using namespace std;
//Руда Єлизавета ФІТ 1-4 В12

int main()
{
    setlocale(0, ".1251");
    double k;
    cout <<"Дано гирі вагою в 0.1кг, 0.2кг, 0.5кг, 1кг, 1.2кг, 1.4кг, 1.5кг, 2кг і 3кг" << endl;
    //Гир дано 10, а варіантів ваги 9, отже є дві гирі з однаковою вагою.
    //Тобто мінімальна вага яку може надати користувач = 0.1кг
    //А максимальона = сумі усіх гирь враховуючи двічі 3 кг =13.9кг
    cout << "Введіть вагу в кілограмах від 0.1кг до 13.9кг. ";
    cin >> k;
    while (k < 0.1 || k > 13.9)
    {
        cout << "Ви ввели недопустиме значення. Введіть від 0.1 до 13.9. ";
        cin >> k;
    }
   cout << round ((k * 10)/10);
}
