// Напишіть програму, що змінює місцями найбільший і найменший 
// елементи заданого не порожнього масиву різних чисел і потім 
// друкує отриманий масив.

#include <iostream>
#include <cstdlib>
//Руда Єлизавета ФІТ 1-4 В12
using namespace std;

int main()
{
    setlocale(0, ".1251");

    int A[10];
    int max, min;
    int max1, min1;
    cout << "Введіть елементи масиву :";

    for (int i = 0; i < 10; i++) //Вводить 10 елементів масиву
    {
        cin >> A[i];
    }
    max = A[0]; //Знаходить максимальне число
    for (int i = 1; i < 10; i++)
    {
        if (A[i] > max)
        {
            max = A[i];
            max1 = i;
        }
    }
    min = A[0];// знаходить мінімальне число
    for (int i = 1; i < 10; i++)
    {
        if (A[i] < min)
        {
            min = A[i];
            min1 = i;
        }
    }


    cout << "Ваш масив:" << " " << A[0] << " " << A[1] << " " << A[2] << " " << A[3] << " " << A[4] << " " << A[5] << " " << A[6] << " " << A[7] << " " << A[8] << " " << A[9] << endl;
    A[min1] = max;
    A[max1] = min;

    cout << "Зиінений масив:" << " " << A[0] << " " << A[1] << " " << A[2] << " " << A[3] << " " << A[4] << " " << A[5] << " " << A[6] << " " << A[7] << " " << A[8] << " " << A[9] << endl;


}
