//	    В масиві X[n] кожний елемент рівний 0, 1 або 2.
//	Переставити елементи масиву так, щоб спочатку 
//	розташовувались всі нулі, потім всі одиниці, 
//	а потім всі двійки (додатковий масив не використовувати).
#include <iostream>
#include <cstdlib>
//Руда Єлизавета ФІТ 1-4 В12
using namespace std;

int main()
{
    setlocale(0, ".1251");

    int n;
    cout << "Введіть величину масиву n ";
    cin >> n;
    int X[n];
    int sum0 = 0;
    int sum1 = 0;
    for (int i = 0; i < n; i++) //Вибирає рандомні числа в масив
    {
        X[i] = rand() % 3;
        cout << X[i] << " ";
    }
    cout << "" << endl;

    for (int i = 0; i < n; i++) //Рухує к-ть одиниць та нулів
    {
        if (X[i] == 0)
        {
            sum0++;
        }
        if (X[i] == 1)
        {
            sum1++;
        }
    }
  

    for (int i = 0; i < n; i++) //Переставляє в правильному порядку
    {
        if (sum0 != 0)
        {
            sum0--;
            X[i] = 0;
        }
        else if (sum1 != 0)
        {
            sum1--;
            X[i] = 1;
        }
        else
        {
            X[i] = 2;
        }
    }

    for (int i = 0; i < n; i++)
    {
        cout << X[i] << " ";
    }
}
